1tontech.angular-material
alexiv.vscode-angular2-files
angular.ng-template
christian-kohler.path-intellisense
cyrilletuzi.angular-schematics
dbaeumer.vscode-eslint
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
infinity1207.angular2-switcher
john-crowson.angular-file-changer
johnpapa.angular2
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
quicktype.quicktype
rbbit.typescript-hero
rctay.karma-problem-matcher
redhat.java
segerdekort.angular-cli
simontest.simontest
steoates.autoimport
stringham.move-ts
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
